#include <stdio.h>
int main(){
    double a,b,c;
    float tax1 = 0.05, tax2 = 0.15, tax3 = 0.30;
    scanf("%lf",&a);
    printf("%.2f\n",a - (a * tax1));
    scanf("%lf",&b);
    b = b + a;
    printf("%.2f\n",b - (b * tax2));
    scanf("%lf",&c);
    c = c + b;
    printf("%.2f",c - (c * tax3));
    return 0;
}


// จงเขียนโปรแกรมตามขั้นตอนดังนี้
// 1. รับราคาสินค้าชิ้นที่ 1
// 2. แสดงยอดที่ต้องชำระตามโปรโมชั่น A ซื้อ 1 ชิ้นได้ส่วนลด 5%
// 3. รับราคาสินค้าชิ้นที่ 2
// 4. แสดงยอดที่ต้องชำระตามโปรโมชั่น B ซื้อ 2 ชิ้นได้ส่วนลด 15%
// 5. รับราคาสินค้าชิ้นที่ 3
// 6. แสดงยอดที่ต้องชำระตามโปรโมชั่น C ซื้อ 3 ชิ้นได้ส่วนลด 30%

// สมมุติราคาสินค้าดังนี้
// 1. รับราคาสินค้าชิ้นที่ 1
// 600
// 2. แสดงยอดที่ต้องชำระตามโปรโมชั่น A ซื้อ 1 ชิ้นได้ส่วนลด 5%
// คำนวณด้วยมือก่อนใช้ทดสอบคำสั่ง
// (570)
// 3. รับราคาสินค้าชิ้นที่ 2
// 799
// 4. แสดงยอดที่ต้องชำระตามโปรโมชั่น B ซื้อ 2 ชิ้นได้ส่วนลด 15%
// คำนวณด้วยมือก่อนใช้ทดสอบคำสั่ง
// (1,189.15)
// 5. รับราคาสินค้าชิ้นที่ 3
// 200
// 6. แสดงยอดที่ต้องชำระตามโปรโมชั่น C ซื้อ 3 ชิ้นได้ส่วนลด 30%
// คำนวณด้วยมือก่อนใช้ทดสอบคำสั่ง
// (1,119.3)

// >>commit 2 (sale.c) “calculate promotion”
